"""
Урок 3
Задание 5
В массиве найти максимальный отрицательный элемент.
Вывести на экран его значение и позицию в массиве
"""

import random

if __name__ == '__main__':
    my_list = [random.randint (0, 100) for number in range (100)]
    print (len(my_list))
